[
  {
    "policy_id": "p001",
    "feedback": "I've been with this insurance company for over a decade, and while their coverage is comprehensive, the recent claim I filed was a nightmare. The process was excruciatingly slow, and I had to provide the same documents multiple times. Customer service representatives were polite, but it felt like they were just reading from a script, unable to actually help. I ended up resolving the issue after escalating it several times, but the entire experience left a sour taste in my mouth."
  },
  {
    "policy_id": "p002",
    "feedback": "The policy offerings are competitive, and I initially chose this company because of their reputation. However, after being involved in an accident, I found the claims process to be incredibly opaque. The website is not user-friendly, and it was hard to track the progress of my claim. Additionally, the adjuster assigned to my case was difficult to reach, and when I finally got in touch, they seemed disinterested in helping me resolve the issue quickly."
  },
  {
    "policy_id": "p003",
    "feedback": "I have mixed feelings about this insurance provider. On one hand, the premium rates are reasonable, and the policy covers a wide range of scenarios. On the other hand, when it came time to file a claim after a flood damaged my home, I was met with delays and a lack of communication. The claims process took weeks longer than I was initially told, and I had to constantly follow up to get updates. I appreciate the coverage, but the service could be significantly improved."
  },
  {
    "policy_id": "p004",
    "feedback": "My experience with this insurance company has been largely positive, but there were some hiccups. While purchasing the policy was straightforward, I encountered problems when trying to make changes to my coverage online. The website kept crashing, and when I called customer service, the wait times were excessively long. Once I finally spoke with someone, they were able to help, but it shouldn't have been that difficult to make a simple change."
  },
  {
    "policy_id": "p005",
    "feedback": "This company came highly recommended, but I was disappointed with how they handled my recent claim. After a car accident, I had to deal with multiple departments to get the necessary approvals for repairs. It felt like I was constantly being passed around, and no one seemed to take ownership of my case. The whole process was frustrating and time-consuming, and it made me reconsider whether I'll renew my policy with them."
  },
  {
    "policy_id": "p006",
    "feedback": "The insurance coverage is excellent, but the customer service leaves a lot to be desired. When I called to inquire about a claim, I was put on hold for over 30 minutes, only to be told that the department I needed was closed. There was no mention of this on the website, and I was left feeling very frustrated. While the representatives were polite, they didn't seem to have the information I needed, and I had to call back several times to get my issue resolved."
  },
  {
    "policy_id": "0007",
    "feedback": "I had a positive experience with this insurer until I needed to file a claim. The initial contact was easy, but after that, things went downhill. The documentation process was confusing, with different representatives asking for different things. It took over a month to get the claim processed, and I felt like I was being kept in the dark the entire time. Better communication would go a long way in improving customer satisfaction."
  },
  {
    "policy_id": "p008",
    "feedback": "As a long-time customer, I expected better service when I needed to file a claim for storm damage. The insurance adjuster was slow to respond, and when they finally did, their assessment of the damage was much lower than expected. I had to dispute the claim, which took additional time and effort. While the claim was eventually resolved, the process was far more difficult than it needed to be, and it left me questioning whether to stay with this company."
  },
  {
    "policy_id": "p009",
    "feedback": "The policy coverage is robust, but the company's customer service is seriously lacking. I had to file a claim after my vehicle was vandalized, and getting through to someone who could actually help was a challenge. The phone system is outdated, and I was repeatedly transferred to the wrong department. When I finally got in touch with the right person, they were helpful, but the initial experience was so frustrating that it overshadowed the positive outcome."
  },
  {
    "policy_id": "p010",
    "feedback": "I have mixed feelings about this insurance company. They offer a wide range of coverage options, and the rates are competitive, but their claims process is a nightmare. After my home was burglarized, I filed a claim and expected a quick resolution. Instead, I was met with delays and a lack of transparency. I had to follow up multiple times to get any sort of update, and it felt like I was being given the runaround. The final payout was fair, but the process to get there was anything but smooth."
  }
]